In [19]:
import pandas as pd
import numpy as np
import pickle
from scipy import stats 
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data
import warnings
import sidetable
warnings.filterwarnings('ignore')
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer
from geopy.geocoders import Nominatim

plt.rcParams["figure.figsize"] = (10,8)

pd.options.display.max_columns = None

## EDA

In [20]:
df = pd.read_csv('data/encuesta_limpia.csv', index_col= 0)
df.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
24795,25-29,Man,Saudi Arabia,Bachelor’s degree,Software Engineer,"Python, SQL, C, C++, Java, Javascript, Other",Other,"Visual Studio ,Visual Studio Code (VSCode)",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
def exploracion(df):

    print(f"El dataframe tiene {df.shape[0]} filas y {df.shape[1]} columnas")  
    print("---")
    print(df.info())
    print("---")
    columnas = [df.columns[num] for num in range(len(df.columns))]
    print(f"Los nombres de las columnas son {columnas}")
    print("---")
    print(f"A continuación se muestran los principales estadísticos numéricos del dataframe {df}:")
    print(df.describe().T)
    print(f"A continuación se muestran los principales estadísticos categóricos del dataframe {df}:")
    print(df.describe(include = "object").T)
    print("---")
    print("Los porcentajes de valores nulos por cada columna son:")
    print(df.isnull().sum() * 100/df.shape[0])
    print("---")
    valores_unicos = [len(df[col].value_counts())for col in columnas]
    valores_unicos_por_columna = list(zip(columnas, valores_unicos))
    print("Estos son los valores únicos por cada columna")
    print(valores_unicos_por_columna)
    print("---")
    print("Los valores duplicados por cada columna son:")
    print(df.duplicated().sum())

In [22]:
exploracion(df)

El dataframe tiene 25973 filas y 23 columnas
---
<class 'pandas.core.frame.DataFrame'>
Int64Index: 25973 entries, 0 to 25972
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            25973 non-null  object
 1   gender         25973 non-null  object
 2   Q3             25973 non-null  object
 3   Q4             25973 non-null  object
 4   Q5             25973 non-null  object
 5   Q7             24941 non-null  object
 6   Q8             24940 non-null  object
 7   Q9             24934 non-null  object
 8   Q11            24720 non-null  object
 9   Q14            23970 non-null  object
 10  Q20            16325 non-null  object
 11  Q21            16251 non-null  object
 12  Q22            16126 non-null  object
 13  Q24            15635 non-null  object
 14  Q25            15391 non-null  object
 15  Q32            9484 non-null   object
 16  Q33            4656 non-null   object
 17  Q41            18489 non-null  object
 18  q_10_completa  24810 non-null  object
 19  q_27_completa  9721 non-null   object
 20  q_29_completa  6234 non-null   object
 21  q_40_completa  19209 non-null  object
 22  q_42_completa  18329 non-null  object
dtypes: object(23)
memory usage: 4.8+ MB
None
---
Los nombres de las columnas son ['age', 'gender', 'Q3', 'Q4', 'Q5', 'Q7', 'Q8', 'Q9', 'Q11', 'Q14', 'Q20', 'Q21', 'Q22', 'Q24', 'Q25', 'Q32', 'Q33', 'Q41', 'q_10_completa', 'q_27_completa', 'q_29_completa', 'q_40_completa', 'q_42_completa']
---
A continuación se muestran los principales estadísticos numéricos del dataframe          age gender                        Q3                 Q4  \
0      50-54    Man                     India  Bachelor’s degree
1      50-54    Man                 Indonesia    Master’s degree
2      22-24    Man                  Pakistan    Master’s degree
3      45-49    Man                    Mexico    Doctoral degree
4      45-49    Man                     India    Doctoral degree
...      ...    ...                       ...                ...
25968  30-34    Man                     Egypt  Bachelor’s degree
25969  22-24    Man                     China    Master’s degree
25970  50-54    Man                    Sweden    Doctoral degree
25971  45-49    Man  United States of America    Master’s degree
25972  18-21    Man                     India  Bachelor’s degree

                            Q5                             Q7      Q8  \
0                        Other                      Python, R  Python
1      Program/Project Manager              SQL, C, C++, Java  Python
2            Software Engineer              Python, C++, Java  Python
3           Research Scientist                         Python  Python
4                        Other              Python, C, MATLAB  Python
...                        ...                            ...     ...
25968             Data Analyst  Python, SQL, Javascript, Bash  Python
25969                  Student                         Python  Python
25970       Research Scientist                            NaN     NaN
25971           Data Scientist                    Python, SQL  Python
25972         Business Analyst                            NaN     NaN

                                                                                              Q9  \
0                                                                                    Vim / Emacs
1                                                                     Notepad++,Jupyter Notebook
2                                                               PyCharm ,Jupyter Notebook, Other
3                                                                        Spyder,Jupyter Notebook
4                                                                Spyder,MATLAB ,Jupyter Notebook
...                                                                                          ...
25968  Jupyter (JupyterLab, Jupyter Notebooks, etc) ,Visual Studio Code (VSCode) , Vim / Emac...
25969                                                                                   PyCharm
25970                                                                                        NaN
25971                                                                 Notepad++,Jupyter Notebook
25972                                                                                        NaN

                                                                       Q11  \
0                                                                 A laptop
1      A cloud computing platform (AWS, Azure, GCP, hosted notebooks, etc)
2                                                                 A laptop
3      A cloud computing platform (AWS, Azure, GCP, hosted notebooks, etc)
4      A cloud computing platform (AWS, Azure, GCP, hosted notebooks, etc)
...                                                                    ...
25968                                                             A laptop
25969                                        A personal computer / desktop
25970                                                                  NaN
25971                                                             A laptop
25972                                                                  NaN

                                                                    Q14  \
0       Matplotlib ,Seaborn ,Ggplot / ggplot2 ,Shiny ,Leaflet / Folium
1                                                           Matplotlib
2                                                           Matplotlib
3                                                           Matplotlib
4                                Matplotlib ,Seaborn ,Ggplot / ggplot2
...                                                                 ...
25968                                              Matplotlib ,Seaborn
25969                                                              None
25970                                                               NaN
25971                                              Matplotlib ,Seaborn
25972                                                               NaN

                                          Q20                       Q21  Q22  \
0                   Manufacturing/Fabrication          50-249 employees  3-4
1                   Manufacturing/Fabrication      1000-9,999 employees  1-2
2                         Academics/Education      1000-9,999 employees    0
3                         Academics/Education      1000-9,999 employees    0
4                         Academics/Education          50-249 employees  5-9
...                                       ...                       ...  ...
25968                    Computers/Technology  10,000 or more employees  20+
25969                                     NaN                       NaN  NaN
25970                     Academics/Education      1000-9,999 employees  20+
25971  Online Service/Internet-based Services  10,000 or more employees  20+
25972                                   Other            0-49 employees    0

                                                                                             Q24  \
0                              None of these activities are an important part of my role at work
1       Build and/or run the data infrastructure that my business uses for storing, analyzing...
2                              None of these activities are an important part of my role at work
3                             Do research that advances the state of the art of machine learning
4      Analyze and understand data to influence product or business decisions, Build prototyp...
...                                                                                          ...
25968  Analyze and understand data to influence product or business decisions, Build and/or r...
25969                                                                                        NaN
25970                          None of these activities are an important part of my role at work
25971                                                                                        NaN
25972                     Analyze and understand data to influence product or business decisions

                 Q25  \
0      25,000-29,999
1      60,000-69,999
2             $0-999
3      30,000-39,999
4      30,000-39,999
...              ...
25968  15,000-19,999
25969            NaN
25970         $0-999
25971            NaN
25972         $0-999

                                                                            Q32  \
0                                                                   PostgreSQL
1                                                                           NaN
2                                                              MySQL , MongoDB
3                                                                           NaN
4                                                                          None
...                                                                         ...
25968   PostgreSQL , SQLite , MongoDB , Microsoft SQL Server , Amazon Redshift
25969                                                                       NaN
25970                                                                       NaN
25971                                                                       NaN
25972                                                                       NaN

            Q33  \
0           NaN
1           NaN
2        MySQL
3           NaN
4           NaN
...         ...
25968  MongoDB
25969       NaN
25970       NaN
25971       NaN
25972       NaN

                                                                        Q41  \
0                Local development environments (RStudio, JupyterLab, etc.)
1                           Advanced statistical software (SPSS, SAS, etc.)
2         Basic statistical software (Microsoft Excel, Google Sheets, etc.)
3                Local development environments (RStudio, JupyterLab, etc.)
4                Local development environments (RStudio, JupyterLab, etc.)
...                                                                     ...
25968  Business intelligence software (Salesforce, Tableau, Spotfire, etc.)
25969                                                                   NaN
25970     Basic statistical software (Microsoft Excel, Google Sheets, etc.)
25971                                                                   NaN
25972                       Advanced statistical software (SPSS, SAS, etc.)

                                                                                   q_10_completa  \
0                                                                                Colab Notebooks
1                                                             Colab Notebooks,  Kaggle Notebooks
2                                                                               Kaggle Notebooks
3                                                                                Colab Notebooks
4                                                                           Google Cloud Datalab
...                                                                                          ...
25968   Databricks Collaborative Notebooks ,  Amazon Sagemaker Studio Notebooks ,  Amazon EMR...
25969                                                                                       None
25970                                                                                        NaN
25971                                                                                       None
25972                                                                                        NaN

                                        q_27_completa  \
0                        Google Cloud Platform (GCP)
1                                                 NaN
2                                                None
3                                                 NaN
4                                    Microsoft Azure
...                                               ...
25968   Microsoft Azure ,  Amazon Web Services (AWS)
25969                                             NaN
25970                                             NaN
25971                                             NaN
25972                                             NaN

                                                                  q_29_completa  \
0                                                  Google Cloud Compute Engine
1                                                                           NaN
2                                                                           NaN
3                                                                           NaN
4                                             Microsoft Azure Virtual Machines
...                                                                         ...
25968   Microsoft Azure Virtual Machines ,  Amazon Elastic Compute Cloud (EC2)
25969                                                                       NaN
25970                                                                       NaN
25971                                                                       NaN
25972                                                                       NaN

                                                                                   q_40_completa  \
0                                  Udacity, Coursera, edX, DataCamp, Kaggle Learn Courses, Udemy
1      Kaggle Learn Courses, University Courses (resulting in a university degree), Cloud-cer...
2                                                                                       DataCamp
3                                                                                  Coursera, edX
4                                                                    Kaggle Learn Courses, Udemy
...                                                                                          ...
25968  Udacity, Coursera, Cloud-certification programs (direct from AWS, Azure, GCP, or simil...
25969                                                                                        NaN
25970                                                                Coursera, LinkedIn Learning
25971                                                                                        NaN
25972                                                                                       None

                                                                                   q_42_completa
0      Kaggle (notebooks, forums, etc), Journal Publications (peer-reviewed journals, confere...
1                     Journal Publications (peer-reviewed journals, conference proceedings, etc)
2            Kaggle (notebooks, forums, etc), YouTube (Kaggle YouTube, Cloud AI Adventures, etc)
3      YouTube (Kaggle YouTube, Cloud AI Adventures, etc), Journal Publications (peer-reviewe...
4                     Journal Publications (peer-reviewed journals, conference proceedings, etc)
...                                                                                          ...
25968  Kaggle (notebooks, forums, etc), YouTube (Kaggle YouTube, Cloud AI Adventures, etc), S...
25969                                                                                        NaN
25970                                                                                       None
25971                                                                                        NaN
25972                                                                                       None

[25973 rows x 23 columns]:
               count unique  \
age            25973     11
gender         25973      5
Q3             25973     66
Q4             25973      7
Q5             25973     15
Q7             24941    825
Q8             24940     13
Q9             24934   1330
Q11            24720      6
Q14            23970    467
Q20            16325     18
Q21            16251      5
Q22            16126      7
Q24            15635     96
Q25            15391     26
Q32             9484   1558
Q33             4656     20
Q41            18489      6
q_10_completa  24810    723
q_27_completa   9721    280
q_29_completa   6234     16
q_40_completa  19209    905
q_42_completa  18329    909

                                                                                  top  \
age                                                                             25-29
gender                                                                            Man
Q3                                                                              India
Q4                                                                    Master’s degree
Q5                                                                            Student
Q7                                                                             Python
Q8                                                                             Python
Q9                                                                   Jupyter Notebook
Q11                                                                          A laptop
Q14                                                              Matplotlib ,Seaborn
Q20                                                              Computers/Technology
Q21                                                                    0-49 employees
Q22                                                                               1-2
Q24            Analyze and understand data to influence product or business decisions
Q25                                                                            $0-999
Q32                                                                              None
Q33                                                                            MySQL
Q41                 Basic statistical software (Microsoft Excel, Google Sheets, etc.)
q_10_completa                                                                    None
q_27_completa                                                                    None
q_29_completa                                                               No / None
q_40_completa                                                                    None
q_42_completa                                         Kaggle (notebooks, forums, etc)

                freq
age             4931
gender         20598
Q3              7434
Q4             10132
Q5              6804
Q7              4740
Q8             20213
Q9              2341
Q11            16231
Q14             5697
Q20             4079
Q21             5055
Q22             3642
Q24             2891
Q25             3369
Q32             2297
Q33             1110
Q41             7246
q_10_completa   7174
q_27_completa   2689
q_29_completa   1795
q_40_completa   1762
q_42_completa   1224
A continuación se muestran los principales estadísticos categóricos del dataframe          age gender                        Q3                 Q4  \
0      50-54    Man                     India  Bachelor’s degree
1      50-54    Man                 Indonesia    Master’s degree
2      22-24    Man                  Pakistan    Master’s degree
3      45-49    Man                    Mexico    Doctoral degree
4      45-49    Man                     India    Doctoral degree
...      ...    ...                       ...                ...
25968  30-34    Man                     Egypt  Bachelor’s degree
25969  22-24    Man                     China    Master’s degree
25970  50-54    Man                    Sweden    Doctoral degree
25971  45-49    Man  United States of America    Master’s degree
25972  18-21    Man                     India  Bachelor’s degree

                            Q5                             Q7      Q8  \
0                        Other                      Python, R  Python

In [23]:
df.stb.missing()

               missing  total    percent
Q33              21317  25973  82.073692
q_29_completa    19739  25973  75.998152
Q32              16489  25973  63.485158
q_27_completa    16252  25973  62.572672
Q25              10582  25973  40.742309
Q24              10338  25973  39.802872
Q22               9847  25973  37.912448
Q21               9722  25973  37.431179
Q20               9648  25973  37.146267
q_42_completa     7644  25973  29.430563
Q41               7484  25973  28.814538
q_40_completa     6764  25973  26.042429
Q14               2003  25973   7.711855
Q11               1253  25973   4.824241
q_10_completa     1163  25973   4.477727
Q9                1039  25973   4.000308
Q8                1033  25973   3.977207
Q7                1032  25973   3.973357
gender               0  25973   0.000000
Q5                   0  25973   0.000000
Q4                   0  25973   0.000000
Q3                   0  25973   0.000000
age                  0  25973   0.000000

In [24]:
df['Q5'].value_counts()

Student                         6804
Data Scientist                  3616
Software Engineer               2449
Other                           2393
Data Analyst                    2301
Currently not employed          1986
Research Scientist              1538
Machine Learning Engineer       1499
Business Analyst                 968
Program/Project Manager          849
Data Engineer                    668
Product Manager                  319
Statistician                     313
DBA/Database Engineer            171
Developer Relations/Advocacy      99
Name: Q5, dtype: int64

In [25]:
df.describe(include='all').T

,count,unique,top,freq
age,25973,11,25-29,4931
gender,25973,5,Man,20598
Q3,25973,66,India,7434
Q4,25973,7,Master’s degree,10132
Q5,25973,15,Student,6804
Q7,24941,825,Python,4740
Q8,24940,13,Python,20213
Q9,24934,1330,Jupyter Notebook,2341
Q11,24720,6,A laptop,16231
Q14,23970,467,"Matplotlib ,Seaborn",5697
Q20,16325,18,Computers/Technology,4079
Q21,16251,5,0-49 employees,5055
Q22,16126,7,1-2,3642
Q24,15635,96,Analyze and understand data to influence product or business decisions,2891
Q25,15391,26,$0-999,3369
Q32,9484,1558,None,2297
Q33,4656,20,MySQL,1110
Q41,18489,6,"Basic statistical software (Microsoft Excel, Google Sheets, etc.)",7246
q_10_completa,24810,723,None,7174
q_27_completa,9721,280,None,2689
q_29_completa,6234,16,No / None,1795
q_40_completa,19209,905,None,1762
q_42_completa,18329,909,"Kaggle (notebooks, forums, etc)",1224

In [26]:
df['Q33'].unique()

array([nan, 'MySQL ', 'IBM Db2 ', 'PostgreSQL ',
       'Google Cloud Firestore ', 'Oracle Database ',
       'Microsoft SQL Server ', 'Microsoft Azure SQL Database ',
       'Snowflake ', 'MongoDB ', 'Google Cloud BigQuery ',
       'Amazon DynamoDB ', 'SQLite ', 'Amazon RDS ', 'Amazon Redshift ',
       'Google Cloud BigTable ', 'Google Cloud SQL ',
       'Microsoft Azure Cosmos DB ', 'Other', 'Amazon Aurora ',
       'Google Cloud Spanner '], dtype=object)

In [27]:
df['Q32'].unique()

array([' PostgreSQL ', nan, 'MySQL , MongoDB ', ...,
       ' MongoDB , Microsoft SQL Server , Amazon Redshift ',
       'MySQL , SQLite , MongoDB , Google Cloud BigTable ',
       ' PostgreSQL , SQLite , MongoDB , Microsoft SQL Server , Amazon Redshift '],
      dtype=object)

In [28]:
df['Q33'].value_counts()

MySQL                            1110
PostgreSQL                        694
Microsoft SQL Server              611
MongoDB                           342
Oracle Database                   316
Google Cloud BigQuery             298
SQLite                            235
Microsoft Azure SQL Database      191
Amazon Redshift                   146
Snowflake                         132
Amazon RDS                         94
Google Cloud SQL                   79
IBM Db2                            78
Amazon DynamoDB                    77
Other                              64
Google Cloud Firestore             60
Microsoft Azure Cosmos DB          54
Amazon Aurora                      34
Google Cloud BigTable              31
Google Cloud Spanner               10
Name: Q33, dtype: int64

In [29]:
df['Q32'].value_counts()

 None                                                                                                                                                                                2297
MySQL                                                                                                                                                                                 754
 PostgreSQL                                                                                                                                                                           288
 Microsoft SQL Server                                                                                                                                                                 287
MySQL , SQLite                                                                                                                                                                        177
                                                                                                                                                                                     ...
MySQL , PostgreSQL , SQLite , Oracle Database , Snowflake , Microsoft SQL Server , Microsoft Azure SQL Database                                                                         1
MySQL , Google Cloud BigTable , Google Cloud Spanner                                                                                                                                    1
MySQL , PostgreSQL , Microsoft Azure SQL Database , Microsoft Azure Cosmos DB , Amazon Redshift , Amazon Aurora , Amazon DynamoDB , Google Cloud BigQuery , Google Cloud Spanner        1
MySQL , Amazon Redshift , Amazon Aurora                                                                                                                                                 1
 PostgreSQL , SQLite , MongoDB , Microsoft SQL Server , Amazon Redshift                                                                                                                 1
Name: Q32, Length: 1558, dtype: int64

In [30]:
df_copia = df.copy()

In [31]:
q32_split = pd.DataFrame(df_copia['Q32'].str.split(' , '))
q32_split

                                                                          Q32
0                                                              [ PostgreSQL ]
1                                                                         NaN
2                                                           [MySQL, MongoDB ]
3                                                                         NaN
4                                                                     [ None]
...                                                                       ...
25968  [ PostgreSQL, SQLite, MongoDB, Microsoft SQL Server, Amazon Redshift ]
25969                                                                     NaN
25970                                                                     NaN
25971                                                                     NaN
25972                                                                     NaN

[25973 rows x 1 columns]

In [32]:
q32_split.explode(['Q32'])

                    Q32
0           PostgreSQL
1                   NaN
2                 MySQL
2              MongoDB
3                   NaN
...                 ...
25968  Amazon Redshift
25969               NaN
25970               NaN
25971               NaN
25972               NaN

[37596 rows x 1 columns]

 ## Analistas Datos en todo el DF

In [36]:
df_data_analyst = df[df['Q5'] == 'Data Analyst']
df_data_analyst.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
6917,25-29,Man,China,Bachelor’s degree,Data Analyst,"Python, R, SQL, Java",Python,PyCharm,A personal computer / desktop,"Matplotlib ,Seaborn ,Ggplot / ggplot2 ,Shiny ,Geoplotlib",Accounting/Finance,"1000-9,999 employees",3-4,"Analyze and understand data to influence product or business decisions, Build prototyp...","25,000-29,999","MySQL , MongoDB",MySQL,"Basic statistical software (Microsoft Excel, Google Sheets, etc.)",Kaggle Notebooks,"Alibaba Cloud , Tencent Cloud",NaN,Kaggle Learn Courses,"Kaggle (notebooks, forums, etc), Blogs (Towards Data Science, Analytics Vidhya, etc), ..."

In [38]:
df_data_analyst.describe(include= 'all').T

,count,unique,top,freq
age,2301,11,25-29,588
gender,2301,5,Man,1759
Q3,2301,65,India,564
Q4,2301,7,Master’s degree,1027
Q5,2301,1,Data Analyst,2301
Q7,2158,213,"Python, SQL",466
Q8,2157,12,Python,1587
Q9,2155,408,Jupyter Notebook,268
Q11,2148,6,A laptop,1507
Q14,2108,191,"Matplotlib ,Seaborn",445
Q20,2187,18,Computers/Technology,391
Q21,2171,5,0-49 employees,664
Q22,2151,7,1-2,522
Q24,2074,70,Analyze and understand data to influence product or business decisions,771
Q25,2039,26,$0-999,529
Q32,1239,326,None,229
Q33,607,20,MySQL,158
Q41,1768,6,"Basic statistical software (Microsoft Excel, Google Sheets, etc.)",722
q_10_completa,2150,181,None,658
q_27_completa,1277,120,None,406
q_29_completa,738,13,No / None,290
q_40_completa,1819,362,None,139
q_42_completa,1760,338,"Kaggle (notebooks, forums, etc)",152

 ## Value Counts Q3: países

In [39]:
df['Q3'].value_counts()

India                                                   7434
United States of America                                2650
Other                                                   1270
Japan                                                    921
China                                                    814
Brazil                                                   751
Russia                                                   742
Nigeria                                                  702
United Kingdom of Great Britain and Northern Ireland     550
Pakistan                                                 530
Egypt                                                    482
Germany                                                  470
Spain                                                    454
Indonesia                                                444
Turkey                                                   416
France                                                   401
South Korea                                              359
Taiwan                                                   334
Canada                                                   331
Bangladesh                                               317
Italy                                                    311
Mexico                                                   279
Viet Nam                                                 277
Australia                                                264
Kenya                                                    248
Colombia                                                 225
Poland                                                   219
Iran, Islamic Republic of...                             195
Ukraine                                                  186
Singapore                                                182
Argentina                                                182
Malaysia                                                 156
Netherlands                                              153
South Africa                                             146
Morocco                                                  140
Israel                                                   138
Thailand                                                 123
Portugal                                                 119
Peru                                                     117
United Arab Emirates                                     111
Tunisia                                                  109
Philippines                                              108
Sri Lanka                                                106
Greece                                                   102
Chile                                                    102
Ghana                                                     99
Saudi Arabia                                              89
Ireland                                                   84
Sweden                                                    81
Hong Kong (S.A.R.)                                        79
Nepal                                                     75
Switzerland                                               71
I do not wish to disclose my location                     69
Belgium                                                   65
Czech Republic                                            63
Romania                                                   61
Austria                                                   51
Belarus                                                   51
Ecuador                                                   50
Denmark                                                   48
Uganda                                                    47
Kazakhstan                                                45
Norway                                                    45
Algeria                                                   44
Ethiopia                                                  43
Iraq                                                      43
Name: Q3, dtype: int64

## EUROPA

In [40]:
lista_europeos = ['Russia', 'United Kingdom of Great Britain and Northern Ireland', 'Germany', 'Spain', 'Turkey', 'France', 'Italy', 'Poland', 'Ukraine', 'Portugal', 'Greece', 'Ireland', 'Sweden', 'Switzerland', 'Belgium', 'Czech Republic', 'Romania', 'Austria', 'Belarus', 'Denmark', 'Norway']

In [46]:
df_europa = df[df['Q3'].isin(lista_europeos)]
df_europa.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
18285,40-44,Woman,France,Master’s degree,Student,"Python, SQL",Python,"Visual Studio Code (VSCode) ,Jupyter Notebook",A laptop,Matplotlib,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"Basic statistical software (Microsoft Excel, Google Sheets, etc.)",Colab Notebooks,NaN,NaN,University Courses (resulting in a university degree),"Email newsletters (Data Elixir, O'Reilly Data & AI, etc), Reddit (r/machinelearning, e..."

In [42]:
df_europa.value_counts().sum()

708

In [43]:
df_europa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4590 entries, 8 to 25970
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            4590 non-null   object
 1   gender         4590 non-null   object
 2   Q3             4590 non-null   object
 3   Q4             4590 non-null   object
 4   Q5             4590 non-null   object
 5   Q7             4477 non-null   object
 6   Q8             4477 non-null   object
 7   Q9             4477 non-null   object
 8   Q11            4451 non-null   object
 9   Q14            4360 non-null   object
 10  Q20            3388 non-null   object
 11  Q21            3377 non-null   object
 12  Q22            3359 non-null   object
 13  Q24            3262 non-null   object
 14  Q25            3209 non-null   object
 15  Q32            1986 non-null   object
 16  Q33            999 non-null    object
 17  Q41            3546 non-null   object
 18  q_10_completa  4462 non-null   object
 19  q_27_completa  2024 non-null   object
 20  q_29_completa  1229 non-null   object
 21  q_40_completa  3675 non-null   object
 22  q_42_completa  3528 non-null   object
dtypes: object(23)
memory usage: 860.6+ KB

- Filtrado por Data Analyst

In [48]:
data_europa = df_europa[df_europa['Q5']== 'Data Analyst']
data_europa.describe(include= 'all').T

,count,unique,top,freq
age,358,10,25-29,81
gender,358,5,Man,276
Q3,358,21,Russia,68
Q4,358,7,Master’s degree,204
Q5,358,1,Data Analyst,358
Q7,346,68,"Python, SQL",93
Q8,346,9,Python,268
Q9,346,142,Jupyter Notebook,34
Q11,345,6,A laptop,225
Q14,340,79,"Matplotlib ,Seaborn",63
Q20,344,18,Accounting/Finance,52
Q21,343,5,0-49 employees,89
Q22,339,7,1-2,90
Q24,326,42,Analyze and understand data to influence product or business decisions,104
Q25,318,22,$0-999,42
Q32,179,80,None,31
Q33,92,12,MySQL,29
Q41,285,6,"Local development environments (RStudio, JupyterLab, etc.)",104
q_10_completa,345,55,None,127
q_27_completa,182,32,None,72
q_29_completa,90,8,No / None,48
q_40_completa,291,132,None,18
q_42_completa,285,133,None,17

In [57]:
df_europa.describe(include='all').T

,count,unique,top,freq
age,4590,11,25-29,883
gender,4590,5,Man,3779
Q3,4590,21,Russia,742
Q4,4590,7,Master’s degree,2287
Q5,4590,15,Data Scientist,848
Q7,4477,442,Python,877
Q8,4477,13,Python,3636
Q9,4477,674,Jupyter Notebook,309
Q11,4451,6,A laptop,2517
Q14,4360,247,"Matplotlib ,Seaborn",1027
Q20,3388,18,Computers/Technology,664
Q21,3377,5,0-49 employees,974
Q22,3359,7,1-2,786
Q24,3262,78,None of these activities are an important part of my role at work,621
Q25,3209,26,$0-999,389
Q32,1986,449,None,499
Q33,999,20,MySQL,198
Q41,3546,6,"Local development environments (RStudio, JupyterLab, etc.)",1731
q_10_completa,4462,238,None,1512
q_27_completa,2024,97,None,669
q_29_completa,1229,14,No / None,400
q_40_completa,3675,502,None,290
q_42_completa,3528,536,"Kaggle (notebooks, forums, etc)",219

## INDIA

In [50]:
df_indo = df[df['Q3'] == 'India']
df_indo.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
16686,25-29,Man,India,Bachelor’s degree,Data Scientist,Python,Python,Other,A laptop,"Matplotlib ,Seaborn",Other,0-49 employees,3-4,"Analyze and understand data to influence product or business decisions, Build and/or r...","10,000-14,999",NaN,NaN,"Local development environments (RStudio, JupyterLab, etc.)","Colab Notebooks, Kaggle Notebooks",NaN,NaN,None,"Kaggle (notebooks, forums, etc), YouTube (Kaggle YouTube, Cloud AI Adventures, etc), P..."

In [52]:
df_indo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7434 entries, 0 to 25972
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            7434 non-null   object
 1   gender         7434 non-null   object
 2   Q3             7434 non-null   object
 3   Q4             7434 non-null   object
 4   Q5             7434 non-null   object
 5   Q7             7151 non-null   object
 6   Q8             7151 non-null   object
 7   Q9             7148 non-null   object
 8   Q11            7072 non-null   object
 9   Q14            6743 non-null   object
 10  Q20            3681 non-null   object
 11  Q21            3645 non-null   object
 12  Q22            3599 non-null   object
 13  Q24            3447 non-null   object
 14  Q25            3376 non-null   object
 15  Q32            1967 non-null   object
 16  Q33            1020 non-null   object
 17  Q41            4606 non-null   object
 18  q_10_completa  7099 non-null   object
 19  q_27_completa  2034 non-null   object
 20  q_29_completa  1393 non-null   object
 21  q_40_completa  4838 non-null   object
 22  q_42_completa  4555 non-null   object
dtypes: object(23)
memory usage: 1.4+ MB

In [53]:
df_indo.describe(include='all').T

,count,unique,top,freq
age,7434,11,18-21,2719
gender,7434,5,Man,5681
Q3,7434,1,India,7434
Q4,7434,7,Bachelor’s degree,4008
Q5,7434,15,Student,2845
Q7,7151,417,Python,1296
Q8,7151,13,Python,6019
Q9,7148,763,Jupyter Notebook,858
Q11,7072,6,A laptop,5417
Q14,6743,246,"Matplotlib ,Seaborn",1918
Q20,3681,18,Computers/Technology,1317
Q21,3645,5,"10,000 or more employees",1157
Q22,3599,7,20+,958
Q24,3447,78,Analyze and understand data to influence product or business decisions,641
Q25,3376,26,$0-999,978
Q32,1967,544,None,430
Q33,1020,20,MySQL,280
Q41,4606,6,"Basic statistical software (Microsoft Excel, Google Sheets, etc.)",2140
q_10_completa,7099,377,None,1530
q_27_completa,2034,147,None,499
q_29_completa,1393,12,No / None,376
q_40_completa,4838,546,None,328
q_42_completa,4555,509,"Kaggle (notebooks, forums, etc), YouTube (Kaggle YouTube, Cloud AI Adventures, etc), B...",392

- Filtrado por Data Analyst

In [62]:
data_indo = df_indo[df_indo['Q5']== 'Data Analyst']
data_indo.describe(include= 'all').T

,count,unique,top,freq
age,564,9,22-24,164
gender,564,5,Man,420
Q3,564,1,India,564
Q4,564,7,Bachelor’s degree,271
Q5,564,1,Data Analyst,564
Q7,516,103,"Python, SQL",120
Q8,516,9,Python,407
Q9,514,161,Jupyter Notebook,91
Q11,513,6,A laptop,396
Q14,498,79,"Matplotlib ,Seaborn",137
Q20,527,18,Computers/Technology,149
Q21,520,5,"10,000 or more employees",158
Q22,516,7,20+,131
Q24,489,56,Analyze and understand data to influence product or business decisions,167
Q25,479,21,$0-999,153
Q32,277,114,None,56
Q33,138,18,MySQL,37
Q41,391,6,"Basic statistical software (Microsoft Excel, Google Sheets, etc.)",190
q_10_completa,513,91,None,106
q_27_completa,291,58,None,90
q_29_completa,179,10,No / None,58
q_40_completa,403,137,Other,29
q_42_completa,388,122,"Kaggle (notebooks, forums, etc)",46

## USA

In [51]:
df_usa = df[df['Q3'] == 'United States of America']
df_usa.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
6414,30-34,Woman,United States of America,Master’s degree,Business Analyst,"Python, R, SQL",Python,Jupyter Notebook,A personal computer / desktop,None,Shipping/Transportation,0-49 employees,10-14,NaN,NaN,NaN,NaN,NaN,None,NaN,NaN,NaN,NaN

In [55]:
df_usa.describe(include= 'all').T

,count,unique,top,freq
age,2650,11,30-34,407
gender,2650,5,Man,1949
Q3,2650,1,United States of America,2650
Q4,2650,7,Master’s degree,1235
Q5,2650,15,Student,452
Q7,2528,363,Python,322
Q8,2527,13,Python,1897
Q9,2527,556,Jupyter Notebook,157
Q11,2510,6,A laptop,1451
Q14,2471,212,None,415
Q20,1924,18,Computers/Technology,419
Q21,1921,5,"10,000 or more employees",628
Q22,1911,7,20+,673
Q24,1867,74,Analyze and understand data to influence product or business decisions,312
Q25,1845,26,"100,000-124,999",289
Q32,1276,395,None,298
Q33,624,20,Microsoft SQL Server,116
Q41,2058,6,"Local development environments (RStudio, JupyterLab, etc.)",880
q_10_completa,2517,191,None,1042
q_27_completa,1306,80,None,306
q_29_completa,916,12,Amazon Elastic Compute Cloud (EC2),279
q_40_completa,2110,437,None,163
q_42_completa,2042,465,None,151

- Filtrado por Data Analyst

In [61]:
data_usa = df_usa[df_usa['Q5']== 'Data Analyst']
data_usa.describe(include= 'all').T

,count,unique,top,freq
age,258,11,30-34,52
gender,258,4,Man,171
Q3,258,1,United States of America,258
Q4,258,7,Master’s degree,143
Q5,258,1,Data Analyst,258
Q7,243,53,"Python, SQL",48
Q8,242,10,Python,146
Q9,242,115,Jupyter Notebook,21
Q11,241,6,A laptop,164
Q14,235,68,None,36
Q20,243,17,Academics/Education,34
Q21,242,5,"10,000 or more employees",71
Q22,241,7,20+,67
Q24,233,37,Analyze and understand data to influence product or business decisions,69
Q25,227,23,"100,000-124,999",42
Q32,154,69,None,29
Q33,75,14,Microsoft SQL Server,26
Q41,201,6,"Local development environments (RStudio, JupyterLab, etc.)",70
q_10_completa,241,42,None,102
q_27_completa,156,29,None,49
q_29_completa,97,9,No / None,48
q_40_completa,207,122,Coursera,15
q_42_completa,199,100,None,21

## ESPAÑA

In [58]:
df_spain = df[df['Q3'] == 'Spain']
df_spain.sample()

,age,gender,Q3,Q4,Q5,Q7,Q8,Q9,Q11,Q14,Q20,Q21,Q22,Q24,Q25,Q32,Q33,Q41,q_10_completa,q_27_completa,q_29_completa,q_40_completa,q_42_completa
9964,22-24,Woman,Spain,Bachelor’s degree,Business Analyst,"Python, SQL",Python,"Spyder,Jupyter Notebook",A laptop,"Seaborn ,Plotly / Plotly Express ,Ggplot / ggplot2",Accounting/Finance,0-49 employees,0,NaN,NaN,NaN,NaN,NaN,None,NaN,NaN,NaN,NaN

In [59]:
df_spain.describe(include='all').T

,count,unique,top,freq
age,454,11,45-49,78
gender,454,4,Man,389
Q3,454,1,Spain,454
Q4,454,7,Master’s degree,217
Q5,454,15,Data Scientist,70
Q7,442,145,Python,59
Q8,442,10,Python,345
Q9,442,191,"Visual Studio Code (VSCode) ,Jupyter Notebook",24
Q11,439,6,A laptop,242
Q14,435,95,"Matplotlib ,Seaborn",89
Q20,360,18,Academics/Education,80
Q21,360,5,0-49 employees,91
Q22,360,7,1-2,87
Q24,347,51,None of these activities are an important part of my role at work,86
Q25,341,22,"40,000-49,999",52
Q32,206,108,None,48
Q33,114,17,MySQL,28
Q41,362,6,"Local development environments (RStudio, JupyterLab, etc.)",182
q_10_completa,440,66,None,166
q_27_completa,211,32,None,67
q_29_completa,132,9,No / None,48
q_40_completa,372,165,None,24
q_42_completa,358,148,"Kaggle (notebooks, forums, etc)",23

- Filtrado por Data Analyst

In [60]:
data_spain = df_spain[df_spain['Q5']== 'Data Analyst']
data_spain.describe(include= 'all').T

,count,unique,top,freq
age,28,8,45-49,7
gender,28,2,Man,21
Q3,28,1,Spain,28
Q4,28,5,Master’s degree,13
Q5,28,1,Data Analyst,28
Q7,28,21,"Python, SQL",4
Q8,28,6,Python,18
Q9,28,21,Jupyter Notebook,4
Q11,28,4,A laptop,18
Q14,28,18,"Matplotlib ,Seaborn",5
Q20,27,10,Academics/Education,9
Q21,27,5,"1000-9,999 employees",8
Q22,27,6,5-9,8
Q24,25,13,Analyze and understand data to influence product or business decisions,6
Q25,24,12,"40,000-49,999",5
Q32,18,15,MySQL,3
Q33,9,6,Microsoft SQL Server,2
Q41,21,5,"Local development environments (RStudio, JupyterLab, etc.)",9
q_10_completa,28,10,None,16
q_27_completa,18,11,None,6
q_29_completa,10,4,No / None,5
q_40_completa,21,19,University Courses (resulting in a university degree),2
q_42_completa,21,16,"Kaggle (notebooks, forums, etc), Blogs (Towards Data Science, Analytics Vidhya, etc), ...",3

- Filtrados por Data Analyst hechos:

 -España

 -Europa

 -India

 -Estados Unidos

- Para el lunes:

 -